In [1]:
import pandas as pd
import os
import numpy as np
from glob import glob

In [2]:
os.getcwd()

'C:\\Users\\soan8006\\Desktop\\Race_practices\\Onboarding\\Onboarding Attendance in Teams\\Onboarding Attendance in Teams\\New folder'

In [3]:
#os.chdir('Onboarding Attendance in Teams\\New folder')

In [4]:
path2=os.getcwd()

In [5]:
#ls1=os.listdir(path2)

In [6]:
os.getcwd()

'C:\\Users\\soan8006\\Desktop\\Race_practices\\Onboarding\\Onboarding Attendance in Teams\\Onboarding Attendance in Teams\\New folder'

In [7]:
f1 = glob('meeting*.csv')
# ls1= [pd.read_csv(f) for f in f1]

In [8]:
f1

['meetingAttendanceReport(HR Onboarding) 9th Aug.csv']

In [9]:
filename=f1[0].split("/")[-1]

In [10]:
filename

'meetingAttendanceReport(HR Onboarding) 9th Aug.csv'

In [11]:
fn1=filename.split('(')

In [12]:
fn2=fn1[1]

In [13]:
fn3=fn2.split(')')

In [14]:
fn4=fn3[0]
fn4

'HR Onboarding'

In [15]:
df1=pd.read_csv(f1[0], delimiter = ' , |\t', skiprows = 7, header=0, encoding = 'utf-16')

<ipython-input-15-970a2bb2e931>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df1=pd.read_csv(f1[0], delimiter = ' , |\t', skiprows = 7, header=0, encoding = 'utf-16')

In [16]:
df1['Full Name']= df1['Full Name'].str.strip('"')
df1['Join Time']= df1['Join Time'].str.strip('"')
df1['Leave Time']= df1['Leave Time'].str.strip('"')

df1['Duration']= df1['Duration'].str.strip('"')
df1['Email']= df1['Email'].str.strip('"')
df1['Role']= df1['Role'].str.strip('"')
df1['Participant ID (UPN)']= df1['Participant ID (UPN)'].str.strip('"')

In [17]:
df1['Join Time'] = pd.to_datetime(df1['Join Time'])
df1['Leave Time'] = pd.to_datetime(df1['Leave Time'])

In [18]:
df1['FD'] = df1['Leave Time']-df1['Join Time']

In [19]:
df1_group = df1.groupby(['Full Name','Email'])['FD'].sum().reset_index()

In [20]:
df1_group['FD'] = df1_group['FD'].astype(str).str.replace('0 days ','')

In [21]:
df1_group['FD1'] = df1_group['FD'].apply(lambda x : (int(x.split(':')[0]) * 60) + (int(x.split(':')[1]) + int(x.split(':')[2]) / 60))
df1_group.head()

            Full Name                           Email        FD        FD1
0          A, Godfrey         Godfrey.A@nielseniq.com  01:18:34  78.566667
1           A, Rita S            Rita.A@nielseniq.com  01:18:50  78.833333
2   Alisha, Noorbasha  Noorbasha.Alisha@nielseniq.com  01:21:15  81.250000
3          Anil, Amal         Amal.Anil@nielseniq.com  01:24:26  84.433333
4  BAIPILLA, VASAVI N   VASAVI.BAIPILLA@nielseniq.com  01:12:00  72.000000

In [22]:
df1_group = df1_group.assign(FN=fn4)

In [23]:
df2_group = df1.groupby(['Full Name'])['FD'].sum().reset_index()

In [24]:
df2_group['FD'] = df2_group['FD'].astype(str).str.replace('0 days ','')

In [25]:
df2_group['FD1'] = df2_group['FD'].apply(lambda x : (int(x.split(':')[0]) * 60) + (int(x.split(':')[1]) + int(x.split(':')[2]) / 60))
df2_group.head()

                       Full Name        FD        FD1
0                     A, Godfrey  01:18:34  78.566667
1                      A, Rita S  01:18:50  78.833333
2  Akanksha Bhriguvanshi (Guest)  00:00:03   0.050000
3              Alisha, Noorbasha  01:21:15  81.250000
4                     Anil, Amal  01:24:26  84.433333

In [26]:
df2_group = df2_group.assign(FN=fn4)

In [27]:
df3=pd.read_excel('C:\\Users\soan8006\\Desktop\\Race_practices\\Onboarding\\Onboarding Attendance in Teams\\Onboarding Attendance in Teams\\New Folder\\Training Timings.xlsx')

In [28]:
df3

,Day of Week,Timing,FN,Total Time,Cutoff Time
0,Monday,10 am - 11 am,IT Onboarding,60,48
1,Monday,3 pm - 4 pm,HR Onboarding,60,48
2,Tuesday,11 am - 1 pm,Discover NielsenIQ & MINOC,120,96
3,Tuesday,3 pm - 4 pm,MINOC Culture & Check-Ins,60,48
4,Wednesday,11 am - 1 pm,CIP E2E Production Overview,120,96

In [29]:
df4=df1_group.merge(df3)
df5=df2_group.merge(df3)

In [30]:
df4.head()

,Full Name,Email,FD,FD1,FN,Day of Week,Timing,Total Time,Cutoff Time
0,"A, Godfrey",Godfrey.A@nielseniq.com,01:18:34,78.566667,HR Onboarding,Monday,3 pm - 4 pm,60,48
1,"A, Rita S",Rita.A@nielseniq.com,01:18:50,78.833333,HR Onboarding,Monday,3 pm - 4 pm,60,48
2,"Alisha, Noorbasha",Noorbasha.Alisha@nielseniq.com,01:21:15,81.250000,HR Onboarding,Monday,3 pm - 4 pm,60,48
3,"Anil, Amal",Amal.Anil@nielseniq.com,01:24:26,84.433333,HR Onboarding,Monday,3 pm - 4 pm,60,48
4,"BAIPILLA, VASAVI N",VASAVI.BAIPILLA@nielseniq.com,01:12:00,72.000000,HR Onboarding,Monday,3 pm - 4 pm,60,48

In [31]:
df5.head()

,Full Name,FD,FD1,FN,Day of Week,Timing,Total Time,Cutoff Time
0,"A, Godfrey",01:18:34,78.566667,HR Onboarding,Monday,3 pm - 4 pm,60,48
1,"A, Rita S",01:18:50,78.833333,HR Onboarding,Monday,3 pm - 4 pm,60,48
2,Akanksha Bhriguvanshi (Guest),00:00:03,0.050000,HR Onboarding,Monday,3 pm - 4 pm,60,48
3,"Alisha, Noorbasha",01:21:15,81.250000,HR Onboarding,Monday,3 pm - 4 pm,60,48
4,"Anil, Amal",01:24:26,84.433333,HR Onboarding,Monday,3 pm - 4 pm,60,48

In [32]:
df4['Attendance']=np.where((df4['FD1'] >= df4['Cutoff Time']), 'Attended', 'Absent')

In [33]:
df5['Attendance']=np.where((df5['FD1'] >= df5['Cutoff Time']), 'Attended', 'Absent')

In [34]:
df4.to_excel('Attendance_with_email_' + f1[0][:-4] + '.xlsx')

In [35]:
df5.to_excel('Attendance_without_email_' + f1[0][:-4] + '.xlsx')